In [1]:
import numpy as np

import pandas as pd

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-03  1.458997  1.944519 -1.004093 -1.420036
2013-01-04  0.504009  1.573303 -0.265110  0.029219
2013-01-05 -0.925856 -1.127457 -2.158809  2.707200
2013-01-06  0.252271  0.753450 -0.065938  0.810257

In [8]:
df2 = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df2.boxplot

<bound method boxplot_frame of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [14]:
df.head

<bound method NDFrame.head of                    A         B         C         D
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-03  1.458997  1.944519 -1.004093 -1.420036
2013-01-04  0.504009  1.573303 -0.265110  0.029219
2013-01-05 -0.925856 -1.127457 -2.158809  2.707200
2013-01-06  0.252271  0.753450 -0.065938  0.810257>

In [15]:
df.tail

<bound method NDFrame.tail of                    A         B         C         D
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-03  1.458997  1.944519 -1.004093 -1.420036
2013-01-04  0.504009  1.573303 -0.265110  0.029219
2013-01-05 -0.925856 -1.127457 -2.158809  2.707200
2013-01-06  0.252271  0.753450 -0.065938  0.810257>

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.to_numpy()

AttributeError: 'DataFrame' object has no attribute 'to_numpy'

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.590141   -0.908143    1.458997    0.504009   -0.925856    0.252271
B   -0.169268   -1.340809    1.944519    1.573303   -1.127457    0.753450
C   -2.323603   -3.001508   -1.004093   -0.265110   -2.158809   -0.065938
D    0.323009   -0.654911   -1.420036    0.029219    2.707200    0.810257

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.323009 -2.323603 -0.169268  0.590141
2013-01-02 -0.654911 -3.001508 -1.340809 -0.908143
2013-01-03 -1.420036 -1.004093  1.944519  1.458997
2013-01-04  0.029219 -0.265110  1.573303  0.504009
2013-01-05  2.707200 -2.158809 -1.127457 -0.925856
2013-01-06  0.810257 -0.065938  0.753450  0.252271

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-05 -0.925856 -1.127457 -2.158809  2.707200
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-06  0.252271  0.753450 -0.065938  0.810257
2013-01-04  0.504009  1.573303 -0.265110  0.029219
2013-01-03  1.458997  1.944519 -1.004093 -1.420036

In [25]:
df['A']

2013-01-01    0.590141
2013-01-02   -0.908143
2013-01-03    1.458997
2013-01-04    0.504009
2013-01-05   -0.925856
2013-01-06    0.252271
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-03  1.458997  1.944519 -1.004093 -1.420036

In [28]:
df['A'&'C'&'D']

TypeError: unsupported operand type(s) for &: 'str' and 'str'

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-03  1.458997  1.944519 -1.004093 -1.420036

In [30]:
df.loc[dates[0]]

A    0.590141
B   -0.169268
C   -2.323603
D    0.323009
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.590141 -0.169268
2013-01-02 -0.908143 -1.340809
2013-01-03  1.458997  1.944519
2013-01-04  0.504009  1.573303
2013-01-05 -0.925856 -1.127457
2013-01-06  0.252271  0.753450

In [32]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.908143 -1.340809
2013-01-03  1.458997  1.944519
2013-01-04  0.504009  1.573303

In [33]:
df.loc['20130102', ['A', 'B']]

A   -0.908143
B   -1.340809
Name: 2013-01-02 00:00:00, dtype: float64

In [34]:
df.loc[dates[0], 'A']

0.5901411437281926

In [35]:
df.at[dates[0], 'A']

0.5901411437281926

In [36]:
df.iloc[3]

A    0.504009
B    1.573303
C   -0.265110
D    0.029219
Name: 2013-01-04 00:00:00, dtype: float64

In [37]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.504009  1.573303
2013-01-05 -0.925856 -1.127457

In [38]:
 df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.908143 -3.001508
2013-01-03  1.458997 -1.004093
2013-01-05 -0.925856 -2.158809

In [39]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911
2013-01-03  1.458997  1.944519 -1.004093 -1.420036

In [40]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.169268 -2.323603
2013-01-02 -1.340809 -3.001508
2013-01-03  1.944519 -1.004093
2013-01-04  1.573303 -0.265110
2013-01-05 -1.127457 -2.158809
2013-01-06  0.753450 -0.065938

In [41]:
df.iloc[1, 1]

-1.3408094964269541

In [42]:
df.iat[1, 1]

-1.3408094964269541

In [43]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.590141 -0.169268 -2.323603  0.323009
2013-01-03  1.458997  1.944519 -1.004093 -1.420036
2013-01-04  0.504009  1.573303 -0.265110  0.029219
2013-01-06  0.252271  0.753450 -0.065938  0.810257

In [44]:
df[df > 0]

                   A         B   C         D
2013-01-01  0.590141       NaN NaN  0.323009
2013-01-02       NaN       NaN NaN       NaN
2013-01-03  1.458997  1.944519 NaN       NaN
2013-01-04  0.504009  1.573303 NaN  0.029219
2013-01-05       NaN       NaN NaN  2.707200
2013-01-06  0.252271  0.753450 NaN  0.810257

In [45]:
df2 = df.copy()

In [49]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.590141 -0.169268 -2.323603  0.323009    one
2013-01-02 -0.908143 -1.340809 -3.001508 -0.654911    one
2013-01-03  1.458997  1.944519 -1.004093 -1.420036    two
2013-01-04  0.504009  1.573303 -0.265110  0.029219  three
2013-01-05 -0.925856 -1.127457 -2.158809  2.707200   four
2013-01-06  0.252271  0.753450 -0.065938  0.810257  three

In [52]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [58]:
df['F'] = s1
df.at[dates[0], 'A'] = 0
df.iat[0, 1] = 0
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -2.323603  5  NaN
2013-01-02 -0.908143 -1.340809 -3.001508  5  1.0
2013-01-03  1.458997  1.944519 -1.004093  5  2.0
2013-01-04  0.504009  1.573303 -0.265110  5  3.0
2013-01-05 -0.925856 -1.127457 -2.158809  5  4.0
2013-01-06  0.252271  0.753450 -0.065938  5  5.0